# Pandas Series

In [2]:
import pandas as pd
import numpy as np

In [2]:
# Series are for single dimensional
obj = pd.Series([4,7,-5,3])
print(obj)

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.sort_values()

2   -5
3    3
0    4
1    7
dtype: int64

In [12]:
print("Values",obj.values, "Index: ",obj.index)

Values [ 4  7 -5  3] Index:  RangeIndex(start=0, stop=4, step=1)

In [14]:
sales = pd.Series([100,200,300,400], index = ['a','b','c','d'])
 print(sales)

a    100
b    200
c    300
d    400
dtype: int64

In [15]:
print("Values",sales.values, "Index: ",sales.index)

Values [100 200 300 400] Index:  Index(['a', 'b', 'c', 'd'], dtype='object')

In [18]:
sales = pd.Series([100,200,300,400], index = ['Jan','Feb','Mar','Apr'], name = "4 Months Sales")
print(sales)

Jan    100
Feb    200
Mar    300
Apr    400
Name: 4 Months Sales, dtype: int64

In [24]:
Canteen = pd.Series([50,60,30,80,90,15,0], index = ['Monday','Tuesday','Wednesday', 'thrusday', 'Friday', 'Saturday', 'Sunday'], name = "Sales of Sandwiches per day in Canteen")
print(Canteen)

Monday       50
Tuesday      60
Wednesday    30
thrusday     80
Friday       90
Saturday     15
Sunday        0
Name: Sales of Sandwiches per day in Canteen, dtype: int64

In [32]:
print(Canteen[1])
print(Canteen["Tuesday"])
print(Canteen["Sunday"])

60
60
0

In [37]:
print(Canteen[ [3,5] ])
print(Canteen[["Tuesday", "Sunday"]])

thrusday    80
Saturday    15
Name: Sales of Sandwiches per day in Canteen, dtype: int64
Tuesday    60
Sunday      0
Name: Sales of Sandwiches per day in Canteen, dtype: int64

In [38]:
print(Canteen[Canteen > 40])

Monday      50
Tuesday     60
thrusday    80
Friday      90
Name: Sales of Sandwiches per day in Canteen, dtype: int64

In [41]:
Canteen = Canteen * 2

In [42]:
print(Canteen)

Monday       100
Tuesday      120
Wednesday     60
thrusday     160
Friday       180
Saturday      30
Sunday         0
Name: Sales of Sandwiches per day in Canteen, dtype: int64

In [45]:
Canteen = Canteen / 2

In [49]:
print(Canteen)

Monday       25.0
Tuesday      30.0
Wednesday    15.0
thrusday     40.0
Friday       45.0
Saturday      7.5
Sunday        0.0
Name: Sales of Sandwiches per day in Canteen, dtype: float64

In [57]:
'Sunday' in Canteen

True

In [30]:
import numpy as np

In [64]:
arr = np.array([3,2,4,5,6])
ind  = np.array(['a','b','c','d','e'])

obj2 = pd.Series(arr,ind, name = "Numpy array to Pandas")

In [65]:
print(obj2)

a    3
b    2
c    4
d    5
e    6
Name: Numpy array to Pandas, dtype: int32

In [69]:
sdata = {"Sindh" : 35000, "Punjab" : 45000, "KPK" : 20000, "Balochistan": 15000}
text_by_state = pd.Series(sdata)
print(text_by_state)

Sindh          35000
Punjab         45000
KPK            20000
Balochistan    15000
dtype: int64

In [79]:
sandwichsale= {1 : 100, 2: 300, 3 : 400, 5 : 5000}
s = pd.Series(sandwichsale)
print(s)

1     100
2     300
3     400
5    5000
dtype: int64

In [4]:
# indentifying null value
sdata = {"Sindh" : 35000, "Punjab" : 45000, "KPK" : 20000, "Balochistan": 15000}
text_by_state = pd.Series(sdata, index = ["Sindh", "Punjab", "KPK", "Balochistan","GB"])
print(text_by_state)
print(pd.isnull(text_by_state))

Sindh          35000.0
Punjab         45000.0
KPK            20000.0
Balochistan    15000.0
GB                 NaN
dtype: float64
Sindh          False
Punjab         False
KPK            False
Balochistan    False
GB              True
dtype: bool

In [5]:
text_by_state.name = "States tax"
text_by_state.index.name = "States Name"

print(text_by_state)
#print(text_by_state.index)

States Name
Sindh          35000.0
Punjab         45000.0
KPK            20000.0
Balochistan    15000.0
GB                 NaN
Name: States tax, dtype: float64

In [ ]:
# Nan values mean, values does not exist in d

In [95]:
Cn = pd.Series([50,60,30,80,90,15,0], index = ['Monday','Tuesday','Wednesday', 'thrusday', 'Friday', 'Saturday', 'Sunday'], name = "Sales of Sandwiches per day in Canteen")
Cn.index = ["m","t","w","t","f","s","s"]
print(Cn)

m    50
t    60
w    30
t    80
f    90
s    15
s     0
Name: Sales of Sandwiches per day in Canteen, dtype: int64

# Data Frame

In [105]:
apples = pd.Series([3,2,0,1])
oranges = pd.Series([5,4,2,1])

data = {"apples": apples, "oranges" : oranges}
fruits_df = pd.DataFrame(data)
print(fruits_df)

   apples  oranges
0       3        5
1       2        4
2       0        2
3       1        1

In [3]:
data = {'State':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
       'Year':[2000, 2001, 2002, 2001, 2002, 2003],
       'Pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data, index = ['1st','2nd','3rd','4th','5th','6th'])
print(frame)

      State  Year  Pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.6
4th  Nevada  2001  2.4
5th  Nevada  2002  2.9
6th  Nevada  2003  3.2

In [127]:
frame.head()

      State  Year  Pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.6
4th  Nevada  2001  2.4
5th  Nevada  2002  2.9

In [7]:
frame = pd.DataFrame(data,index = ['1st','2nd','3rd','4th','5th','6th'], columns = ['Year','State','Pop'])
display(frame.head())

     Year   State  Pop
1st  2000    Ohio  1.5
2nd  2001    Ohio  1.7
3rd  2002    Ohio  3.6
4th  2001  Nevada  2.4
5th  2002  Nevada  2.9

In [89]:
frame2 = pd.DataFrame(data,index = ['1st','2nd','3rd','4th','5th','6th'], columns = ['Year','State','Pop','Debt'])
print(frame2)

     Year   State  Pop Debt
1st  2000    Ohio  1.5  NaN
2nd  2001    Ohio  1.7  NaN
3rd  2002    Ohio  3.6  NaN
4th  2001  Nevada  2.4  NaN
5th  2002  Nevada  2.9  NaN
6th  2003  Nevada  3.2  NaN

In [90]:
print(frame2.columns,
frame2.index)

Index(['Year', 'State', 'Pop', 'Debt'], dtype='object') Index(['1st', '2nd', '3rd', '4th', '5th', '6th'], dtype='object')

In [91]:
#Retriving the data from dataframe
#A column in a DataFrame can be retrieved as a Series either by dict like notation or by attribute:
display(data)

{'State': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'Year': [2000, 2001, 2002, 2001, 2002, 2003],
 'Pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [93]:
print(data['Pop' ])
print(data['State']) # <-- dict like notation
frame2['Year']#<-- this dict like notation to access or extract dataframe column data

[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']

1st    2000
2nd    2001
3rd    2002
4th    2001
5th    2002
6th    2003
Name: Year, dtype: int64

In [17]:
#there is another method, attribute style of accessing dataframe
frame2.Year # <-- this is attribute like way to access or extract dataframe column data

1st    2000
2nd    2001
3rd    2002
4th    2001
5th    2002
6th    2003
Name: Year, dtype: int64

In [23]:

print(frame.loc['6th'],"\n***************\n",frame.loc['5th'])

Year       2003
State    Nevada
Pop         3.2
Name: 6th, dtype: object
***************
 Year       2002
State    Nevada
Pop         2.9
Name: 5th, dtype: object

In [28]:
print(frame2)

     Year   State  Pop Debt
1st  2000    Ohio  1.5  NaN
2nd  2001    Ohio  1.7  NaN
3rd  2002    Ohio  3.6  NaN
4th  2001  Nevada  2.4  NaN
5th  2002  Nevada  2.9  NaN
6th  2003  Nevada  3.2  NaN

In [35]:
ln = len(frame2) #finding no of rows in dataframe

In [36]:
rng = np.arange(ln)
rng

array([0, 1, 2, 3, 4, 5])

In [38]:
frame2.Debt = rng
frame2

     Year   State  Pop  Debt
1st  2000    Ohio  1.5     0
2nd  2001    Ohio  1.7     1
3rd  2002    Ohio  3.6     2
4th  2001  Nevada  2.4     3
5th  2002  Nevada  2.9     4
6th  2003  Nevada  3.2     5

In [46]:
frame2['Debt']['2nd'] = 6
frame2

<ipython-input-46-61ddda60dcdb>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  frame2['Debt']['2nd'] = 6

     Year   State  Pop  Debt
1st  2000    Ohio  1.5     6
2nd  2001    Ohio  1.7     6
3rd  2002    Ohio  3.6     2
4th  2001  Nevada  2.4     3
5th  2002  Nevada  2.9     4
6th  2003  Nevada  3.2     5

In [49]:
val = pd.Series([-1.2, -1.5, -1.7, -1.2, -1.5, -1.7, 2.2  ], index = ['Zero', 'two','three','four','five','six','seven'])
frame2['Debt']= val
frame2

     Year   State  Pop  Debt
1st  2000    Ohio  1.5   NaN
2nd  2001    Ohio  1.7   NaN
3rd  2002    Ohio  3.6   NaN
4th  2001  Nevada  2.4   NaN
5th  2002  Nevada  2.9   NaN
6th  2003  Nevada  3.2   NaN

In [52]:
val = pd.Series([-1.2, -1.5, -1.7, -1.2, -1.5, -1.7  ], index = ['1st','2nd','3rd','4th','5th','6th'])
frame2['Debt']= val
frame2

     Year   State  Pop  Debt
1st  2000    Ohio  1.5  -1.2
2nd  2001    Ohio  1.7  -1.5
3rd  2002    Ohio  3.6  -1.7
4th  2001  Nevada  2.4  -1.2
5th  2002  Nevada  2.9  -1.5
6th  2003  Nevada  3.2  -1.7

# Function Application and Mapping

In [4]:
import numpy as np
frame = frame = pd.DataFrame(np.random.rand(4,3), 
                             columns= list('bde'),
                            index =['Utah','Ohio','Texas', 'Oregon'])
print(frame)
#print(np.abs(frame)) #abs make negative values positive
#print(frame["d"].min())
#print(frame["d"].max())
print(frame["d"].max() - frame["d"].min())

def min_max(x):
    minimum = x.min()
    maximum = x.max()
    return pd.Series([maximum, minimum], index = ['max', 'min'])
df = frame.apply(min_max)
print(df, type(df))

               b         d         e
Utah    0.721181  0.245817  0.811022
Ohio    0.379168  0.021967  0.559008
Texas   0.837095  0.449108  0.374742
Oregon  0.654693  0.012437  0.795827
0.43667062946838753
            b         d         e
max  0.837095  0.449108  0.811022
min  0.379168  0.012437  0.374742 <class 'pandas.core.frame.DataFrame'>

In [15]:
#Sorting and Ranking
frame = pd.DataFrame(np.arange(8).reshape((2,4)),
                     index=['three','one'],
                    columns= ['d','a','b','c'])
print(frame)
print()
print(frame.sort_index(axis = 1, ascending = False))
print()
print(frame.sort_index())

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [21]:
# sort by values
#learn from book 
frame = frame = pd.DataFrame(np.random.rand(4,3), 
                             columns= list('bde'),
                            index =['Utah','Ohio','Texas', 'Oregon'])
print(frame)
#print( frame.sort_values(by = 'd'))
print(frame.rank(ascending = False, method = 'max'))
print(frame.rank(ascending = True, method = 'min'))
print( frame.rank(axis = 'columns'))

               b         d         e
Utah    0.436486  0.990380  0.710527
Ohio    0.096931  0.639986  0.256845
Texas   0.184483  0.749807  0.777968
Oregon  0.986059  0.054429  0.008083
          b    d    e
Utah    2.0  1.0  2.0
Ohio    4.0  3.0  3.0
Texas   3.0  2.0  1.0
Oregon  1.0  4.0  4.0
          b    d    e
Utah    3.0  4.0  3.0
Ohio    1.0  2.0  2.0
Texas   2.0  3.0  4.0
Oregon  4.0  1.0  1.0
          b    d    e
Utah    1.0  3.0  2.0
Ohio    1.0  3.0  2.0
Texas   1.0  2.0  3.0
Oregon  3.0  2.0  1.0

In [23]:
df = pd.DataFrame([
    [1.4,np.nan], [7.1, -4.5],
    [np.nan,np.nan,np.nan],[0.75, -1.3]],
     index = ['a','b','c','d'],
    columns= ['one','two','three'])
print(df)
print()
print(df.sum())
print()
print(df.sum(axis = 'columns'))

    one  two  three
a  1.40  NaN    NaN
b  7.10 -4.5    NaN
c   NaN  NaN    NaN
d  0.75 -1.3    NaN

one      9.25
two     -5.80
three    0.00
dtype: float64

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [126]:
print(df)
x = df.mean(axis = 'columns', skipna = False) #skipna ko true kr k NAn values neglect kr sakta hai
print()
print(x)

    one  two  three
a  1.40  NaN    NaN
b  7.10 -4.5    NaN
c   NaN  NaN    NaN
d  0.75 -1.3    NaN

a   NaN
b   NaN
c   NaN
d   NaN
dtype: float64

In [26]:
df = pd.DataFrame([
    [1.4,1.4], [7.1, 1.4],
    [np.nan,np.nan,np.nan],[0.75, -1.3]],
     index = ['a','b','c','d'],
    columns= ['one','two','three'])
print(df)
print()
print(df['one'].unique(), df['two'].unique())
df['one'].value_counts()

    one  two  three
a  1.40  1.4    NaN
b  7.10  1.4    NaN
c   NaN  NaN    NaN
d  0.75 -1.3    NaN

[1.4  7.1   nan 0.75] [ 1.4  nan -1.3]

0.75    1
1.40    1
7.10    1
Name: one, dtype: int64

In [29]:
data_df = pd.DataFrame(np.arange(16).reshape((4 ,4)),
                      index = ['Ohio','Colorado','Utah','New York'],
                      columns=['one','two','three','four'])
print(data_df, "\n")
# in the loc method specify row label first then specify column names
#multiple column names require array notation
#print( data_df.loc[['Colorado','Ohio'],['two','three']])
#print("\n")
print(data_df.iloc[2,[3,2,0]]) # using number intead of labels
#print(data_df.iloc[:])
#print(data_df.one[2:])
#print(data_df.iloc[:,:3])
#print(data_df.iloc[:2])
#[data_df.three > 5]
#df2 = data_df["three"] > 5 
#print(df2)
#print(data_df[df2])
#print(data_df.three[data_df['three']> 7])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

four     11
three    10
one       8
Name: Utah, dtype: int32

# Arithmetic and Data Alignment

In [30]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)),
                  columns=list('bcd'),
                  index =['Ohio','Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)),
                  columns=list('bde'),
                  index=['Utah','Ohio','Texas','Oregon'])
print(df1)
print(df2)
print()
#when we add two dataframe index should be match and if it does not match then it will show us Nan
#adding two dataframes
df3 = df1 + df2
df4 = df1 - df2
print()
print("Direct + opteration without fill value")
print(df3)
#your work is to fill all Nan values of this df3 with a number,
#choice of number is yours
print("------------------")
print()
#we can use add method for filling Nan cells with a value 
#Nan will be replaced by 0 and then addition operation will apply

print("addition using a method with replacing Nan with 0 ")
df3 = df1.add(df3, fill_value = 0)
print(df3)

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0
          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0


Direct + opteration without fill value
            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN
------------------

addition using a method with replacing Nan with 0
             b    c     d   e
Colorado   6.0  7.0   8.0 NaN
Ohio       3.0  1.0   8.0 NaN
Oregon     NaN  NaN   NaN NaN
Texas     12.0  4.0  17.0 NaN
Utah       NaN  NaN   NaN NaN

In [32]:
df1=pd.DataFrame(np.arange(12.).reshape((3,4)),
                  columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),
                  columns=list('abcde'))
#print(df1)
#print(df2)
print()
#when we add two dataframe index should be match and if it does not match then it will show us Nan
#adding two dataframes
df3 = df1 + df2
df4 = df1 - df2
print()
print("Direct + opteration without fill value")
print(df3)
#your work is to fill all Nan values of this df3 with a number,
#choice of number is yours
print("------------------")
print()
#we can use add method for filling Nan cells with a value 
#Nan will be replaced by 0 and then addition operation will apply

print("addition using a method with replacing Nan with 0 ")
df3 = df1.add(df2, fill_value = 0)
print(df3)

Direct + opteration without fill value
      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN
------------------

addition using a method with replacing Nan with 0
      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

# Operation between DataFrame and Series

In [56]:
frame = pd.DataFrame(np.arange(12.).reshape((4,3)),
                    columns=list('bde'),
                    index = ['Utah', 'Ohio','Texas', 'Oregon'])
#iloc syntax 
#iloc[start_row_positon:end_row_pos, start_column_pos:end_col_position]
series = frame.iloc[0]
print(frame)
print(series)
print(series.values)
#print(series.index)
#print(frame - series)
#step 1: run above commands after uncomment
#step 2: comment above prints except the line contains print(frame)
#write following lines
print("----------using new series")
series = pd.Series([1,2,3], index = list('bde'))
print(series.index, series.values)
print(frame - series)
#dataframe column names will be match with series index
#because its rows wise broadcasting operation

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0
b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64
[0. 1. 2.]
----------using new series
Index(['b', 'd', 'e'], dtype='object') [1 2 3]
          b    d    e
Utah   -1.0 -1.0 -1.0
Ohio    2.0  2.0  2.0
Texas   5.0  5.0  5.0
Oregon  8.0  8.0  8.0

In [75]:
 df2 = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index = ["Ohio","colorado","Utah","New York"],
                  columns=['one','two','three','four'])
print(df2,"\n")
#dataframe.drop method would return a new dataframe without having
#delete rows. so store its into to dataframe variable
# or use inplace = True while dropping rows or column

#df2.drop(['colorado','Ohio'], inplace = True)
#print(df2)

#you can drop values from the columns by passing axis = 1
#df2 = df2.drop('two', axis = 1)
#if i want to rremove a row then axis should be 0 axis = 0
df2.drop('two', axis = 1, inplace = True)
print(df2)

          one  two  three  four
Ohio        0    1      2     3
colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  three  four
Ohio        0      2     3
colorado    4      6     7
Utah        8     10    11
New York   12     14    15

# Indexing, Selection and Filtering

In [82]:
data_df = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index = ["Ohio","colorado","Utah","New York"],
                  columns=['one','two','three','four'])
print(data_df, "\n")
#print(data_df[["one","three"]])
#print(data_df[2:])
#print(data_df[:2])

#conditional Selection
#print(data_df[data_df['three'] > 5])
#print(data_df,"\n")
df2 = data_df['three'] > 5
print(df2)
print(data_df[data_df["three"] > 5])

          one  two  three  four
Ohio        0    1      2     3
colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Ohio        False
colorado     True
Utah         True
New York     True
Name: three, dtype: bool
          one  two  three  four
colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [203]:
#Mind Teaser !!
#Assigning a column that alreay exist will __________ and 
# assigning a column that does not exist ___________

# Reindex

In [227]:
obj3 = pd.Series(['blue','purple','Yellow'], index = [0,3,6])
print(obj3)
#might create a new rows
obj3 = obj3.reindex(range(9), method = 'ffill') #ffill is fill forward
#obj3
obj3 = obj3.reindex(range(12), method = 'ffill')  #ffill is fill forward
obj3

0      blue
3    purple
6    Yellow
dtype: object

0       blue
1       blue
2       blue
3     purple
4     purple
5     purple
6     Yellow
7     Yellow
8     Yellow
9     Yellow
10    Yellow
11    Yellow
dtype: object

In [84]:
states = pd.DataFrame(np.arange(9).reshape((3,3)),
                     index =['a','b','c'], 
                     columns =['Ohio','Texas','California'])
print(states)
statess = states.reindex(['a','b','c','d'], method = 'ffill')
print(statess)

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8
   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8
d     6      7           8

In [86]:
states = pd.DataFrame(np.arange(9).reshape((3,3)),
                     index =['a','b','c'], 
                     columns =['Ohio','Texas','California'])
print(states)
states_name = ['Texas','Utah','California','Ohio']
states1 = states.reindex(columns  = ['Ohio','Newyork','California','Texas','Newjersy'],fill_value = 100)
print(states1)

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8
   Ohio  Newyork  California  Texas  Newjersy
a     0      100           2      1       100
b     3      100           5      4       100
c     6      100           8      7       100